FemDesign.Materials.MaterialDatabase
Material database.

FemDesign.Materials.MaterialDatabase.#ctor
Parameterless constructor for serialization.

FemDesign.Materials.MaterialDatabase.MaterialNames
Lists the names of all Materials in MaterialDatabase.
Returns: List of material names.

FemDesign.Materials.MaterialDatabase.MaterialByName(System.String)
Get Material from MaterialDatabase by name.
materialName: Name of Material
Returns:

FemDesign.Materials.MaterialDatabase.DeserializeStruxml(System.String)
Load a custom MaterialDatabase from a .struxml file.
filePath: File path to .struxml file.
Returns:

FemDesign.Materials.MaterialDatabase.DeserializeResource(System.String)
Deserialize MaterialDatabase from embedded resource.

FemDesign.Materials.MaterialDatabase.GetDefault(System.String)
Load the default MaterialDatabase for each respective country.
Remarks: Create
countryCode: National annex of calculation code (D/DK/EST/FIN/GB/H/N/PL/RO/S/TR)
Returns:

FemDesign.Materials.MaterialDatabase.Serialize(System.String)
Serialize MaterialDatabase to file (.struxml).